// ============how it works=================
// input:
  // ll a: aの逆元を求める
  // ll m: mod
    // a　と m は互いに素でなければならない
// output:
  // ll u: a　の逆元
// ========================================


//=============modinv============================
ll modinv(ll a, ll m) {
    ll b = m, u = 1, v = 0;
    while (b) {
        ll t = a / b;
        a -= t * b; swap(a, b);
        u -= t * v; swap(u, v);
    }
    u %= m;
    if (u < 0) u += m;
    return u;
}
//=================================================
